{
  "common": {
    "name": "sql",
    "title": "SQL History",
    "titleLang": {
      "en": "SQL logging",
      "de": "SQL-Protokollierung",
      "ru": "Ведение журнала SQL",
      "pt": "Log de SQL",
      "nl": "SQL logging",
      "fr": "Journalisation SQL",
      "it": "Registrazione SQL",
      "es": "Registro de SQL",
      "pl": "Rejestrowanie SQL",
      "zh-cn": "SQL记录"
    },
    "desc": {
      "en": "Logging of states into SQL DB",
      "de": "Loggt die Historie von einzelnen Zuständen in einer SQL DB",
      "ru": "Сохраняет историю событий для отдельных состояний в SQL DB",
      "pt": "Registro de estados em SQL DB",
      "nl": "Logging van toestanden in SQL DB",
      "fr": "Journalisation des états dans la base de données SQL",
      "it": "Registrazione degli stati nel DB SQL",
      "es": "Registro de estados en SQL DB",
      "pl": "Rejestrowanie stanów w SQL DB",
      "zh-cn": "将状态记录到SQL DB"
    },
    "version": "2.1.4",
    "news": {
      "2.1.3": {
        "en": "Make sure debug log is active according to the settings",
        "de": "Stellen Sie sicher, dass das Debug-Log gemäß den Einstellungen aktiv ist",
        "ru": "Убедитесь, что журнал debug активен в соответствии с настройками",
        "pt": "Certifique-se de que o log de depuração está ativo de acordo com as configurações",
        "nl": "Zorg ervoor dat het logboek actief is volgens de instellingen",
        "fr": "Assurez-vous que le journal debug est actif selon les paramètres",
        "it": "Assicurarsi che il registro di debug sia attivo in base alle impostazioni",
        "es": "Asegúrese de que el registro de depuración está activo según la configuración",
        "pl": "Umożliwia to, że log debug jest aktywny zgodnie z ustawieniami",
        "zh-cn": "B. 根据环境,确保有色色逻辑积极。"
      },
      "2.1.2": {
        "en": "Huge performance optimizations for GetHistory calls",
        "de": "Riesige Leistungsoptimierungen für GetHistory-Anrufe",
        "ru": "Огромная оптимизация производительности для звонков GetHistory",
        "pt": "Otimizações de desempenho enormes para chamadas GetHistory",
        "nl": "Grote prestaties voor GetHistory",
        "fr": "Des optimisations de performance énormes pour les appels GetHistory",
        "it": "Ottimizzazione delle prestazioni enormi per le chiamate GetHistory",
        "es": "Amplias optimizaciones de rendimiento para llamadas GetHistory",
        "pl": "Optymalizacja wyników Huge'a dla GetHistory'ego nawołuje się do optymalizacji wydajności",
        "zh-cn": "GetHistory呼声的优越性"
      },
      "2.1.1": {
        "en": "Fix crash cases reported by Sentry",
        "de": "Von Sentry gemeldete Absturzfälle beheben",
        "ru": "Исправить случаи сбоев, о которых сообщил Sentry",
        "pt": "Corrigir casos de travamento relatados pelo Sentinela",
        "nl": "Herstel crashgevallen gemeld door Sentry",
        "fr": "Correction des cas de plantage signalés par Sentry",
        "it": "Risolvi i casi di crash segnalati da Sentry",
        "es": "Solucionar casos de fallas informados por Sentry",
        "pl": "Napraw przypadki awarii zgłoszone przez Sentry",
        "zh-cn": "修复 Sentry 报告的崩溃案例"
      },
      "2.1.0": {
        "en": "Fix crash cases reported by Sentry\nFix several places where pooled connections might have not been returned to pool correctly and add logging for it\nWork around an issue in used Pooling library that potentially gave out too many connections\nOptimize retention check to better spread the first checks over time\nDefault to not use datapoint buffering as in 1.x when set to 0\nMake sure disabling \"Log changes only\" also really do not log the changes anymore\nAllow storeState and GetHistory also to be called for \"unknown ids\"\nAdjust the fallback logic for type detection to use the type of the state value to log as last fallback\nFix storing booleans on MSSQL",
        "de": "Von Sentry gemeldete Absturzfälle beheben\nBeheben Sie mehrere Stellen, an denen gepoolte Verbindungen möglicherweise nicht korrekt an den Pool zurückgegeben wurden, und fügen Sie die Protokollierung dafür hinzu\nUmgehung eines Problems in der verwendeten Pooling-Bibliothek, das möglicherweise zu viele Verbindungen ausgegeben hat\nOptimieren Sie die Aufbewahrungsprüfung, um die ersten Prüfungen besser über die Zeit zu verteilen\nStandardmäßig keine Datenpunktpufferung wie in 1.x verwenden, wenn auf 0 gesetzt\nStellen Sie sicher, dass durch Deaktivieren von \"Nur Änderungen protokollieren\" die Änderungen auch wirklich nicht mehr protokolliert werden\nAufruf von storeState und GetHistory auch für \"unbekannte IDs\" zulassen\nPassen Sie die Fallback-Logik für die Typerkennung so an, dass der Typ des Statuswerts als letzter Fallback protokolliert wird\nFehler beim Speichern von booleschen Werten in MSSQL behoben",
        "ru": "Исправить случаи сбоев, о которых сообщил Sentry\nИсправьте несколько мест, где соединения из пула могли быть неправильно возвращены в пул, и добавьте для этого ведение журнала.\nОбойти проблему в используемой библиотеке пулов, которая потенциально выдавала слишком много соединений.\nОптимизируйте проверку хранения, чтобы лучше распределять первые проверки по времени.\nПо умолчанию буферизация точек данных не используется, как в 1.x, если установлено значение 0.\nУбедитесь, что отключение «Только журнал изменений» также действительно больше не регистрирует изменения.\nРазрешить также вызывать storeState и GetHistory для «неизвестных идентификаторов».\nНастройте резервную логику для определения типа, чтобы использовать тип значения состояния для регистрации в качестве последнего резервного варианта.\nИсправление хранения логических значений в MSSQL",
        "pt": "Corrigir casos de travamento relatados pelo Sentinela\nCorrija vários locais onde as conexões em pool podem não ter sido retornadas ao pool corretamente e adicione o registro para ele\nContorne um problema na biblioteca de pooling usada que potencialmente forneceu muitas conexões\nOtimize a verificação de retenção para distribuir melhor as primeiras verificações ao longo do tempo\nPadrão para não usar o buffer de ponto de dados como em 1.x quando definido como 0\nCertifique-se de desativar \"Somente alterações de log\" também não registra mais as alterações\nPermitir que storeState e GetHistory também sejam chamados para \"ids desconhecidos\"\nAjuste a lógica de fallback para detecção de tipo para usar o tipo do valor de estado para registrar como último fallback\nCorrige o armazenamento de booleanos no MSSQL",
        "nl": "Herstel crashgevallen gemeld door Sentry\nLos verschillende plaatsen op waar gepoolde verbindingen mogelijk niet correct zijn teruggestuurd naar de pool en voeg er logboeken voor toe\nOmzeil een probleem in de gebruikte pooling-bibliotheek die mogelijk te veel verbindingen opleverde\nOptimaliseer de retentiecontrole om de eerste controles beter over de tijd te spreiden\nStandaard om datapuntbuffering niet te gebruiken zoals in 1.x indien ingesteld op 0\nZorg ervoor dat het uitschakelen van \"Alleen wijzigingen loggen\" ook echt de wijzigingen niet meer logt\nToestaan dat storeState en GetHistory ook worden aangeroepen voor \"onbekende id's\"\nPas de fallback-logica voor typedetectie aan om het type statuswaarde te gebruiken om te loggen als laatste fallback\nFix opslaan van booleans op MSSQL",
        "fr": "Correction des cas de plantage signalés par Sentry\nCorrigez plusieurs endroits où les connexions groupées n'ont peut-être pas été renvoyées correctement au pool et ajoutez-y une journalisation\nContourner un problème dans la bibliothèque de mise en commun utilisée qui a potentiellement donné trop de connexions\nOptimiser le contrôle de rétention pour mieux répartir les premiers contrôles dans le temps\nPar défaut pour ne pas utiliser la mise en mémoire tampon des points de données comme dans 1.x lorsqu'il est défini sur 0\nAssurez-vous que la désactivation de \"Log changes only\" n'enregistre plus vraiment les modifications\nAutoriser storeState et GetHistory à être également appelés pour les \"identifiants inconnus\"\nAjustez la logique de repli pour la détection de type afin d'utiliser le type de la valeur d'état à enregistrer comme dernier repli\nCorrection du stockage des booléens sur MSSQL",
        "it": "Risolvi i casi di crash segnalati da Sentry\nRisolvi diversi punti in cui le connessioni in pool potrebbero non essere state restituite al pool correttamente e aggiungi la registrazione per esso\nRisolvere un problema nella libreria di pooling utilizzata che potenzialmente ha fornito troppe connessioni\nOttimizza il controllo di conservazione per distribuire meglio i primi controlli nel tempo\nL'impostazione predefinita non utilizza il buffering dei punti dati come in 1.x quando è impostato su 0\nAssicurati che la disabilitazione di \"Registra solo modifiche\" non registri più le modifiche\nConsenti la chiamata anche a storeState e GetHistory per \"ID sconosciuti\"\nRegola la logica di fallback per il rilevamento del tipo per utilizzare il tipo del valore di stato da registrare come ultimo fallback\nRisolto il problema con la memorizzazione dei booleani su MSSQL",
        "es": "Solucionar casos de fallas informados por Sentry\nCorrija varios lugares donde las conexiones agrupadas podrían no haber regresado al grupo correctamente y agregue el registro para ello\nSolucione un problema en la biblioteca de agrupación utilizada que potencialmente proporcionó demasiadas conexiones\nOptimice el control de retención para distribuir mejor los primeros controles a lo largo del tiempo\nPredeterminado para no usar el almacenamiento en búfer de puntos de datos como en 1.x cuando se establece en 0\nAsegúrese de deshabilitar \"Registrar solo cambios\" y realmente no registre más los cambios\nPermitir que storeState y GetHistory también se llamen para \"identificadores desconocidos\"\nAjuste la lógica de respaldo para la detección de tipo para usar el tipo del valor de estado para registrar como último respaldo\nArreglar el almacenamiento de booleanos en MSSQL",
        "pl": "Napraw przypadki awarii zgłoszone przez Sentry\nNapraw kilka miejsc, w których połączenia z puli mogły nie zostać poprawnie zwrócone do puli i dodaj dla tego logowanie\nObejdź problem w używanej bibliotece Pooling, który potencjalnie powodował zbyt wiele połączeń\nZoptymalizuj kontrolę retencji, aby lepiej rozłożyć pierwsze kontrole w czasie\nDomyślnie nie używa buforowania punktu danych, jak w 1.x, gdy jest ustawione na 0\nUpewnij się, że wyłączenie opcji „Zapisuj tylko zmiany” również naprawdę nie powoduje już rejestrowania zmian\nZezwalaj na wywoływanie storeState i GetHistory również dla „nieznanych identyfikatorów”\nDostosuj logikę rezerwy dla wykrywania typu, aby użyć typu wartości stanu do zalogowania jako ostatniej rezerwy\nNapraw przechowywanie wartości logicznych w MSSQL",
        "zh-cn": "修复 Sentry 报告的崩溃案例\n修复池连接可能未正确返回池的几个地方并为其添加日志记录\n解决使用过的池库中可能给出过多连接的问题\n优化保留检查，以便随着时间的推移更好地传播第一次检查\n默认设置为 0 时不使用 1.x 中的数据点缓冲\n确保禁用“仅记录更改”也不再记录更改\n还允许为“未知 ID”调用 storeState 和 GetHistory\n调整类型检测的回退逻辑以使用状态值的类型记录为最后一个回退\n修复在 MSSQL 上存储布尔值"
      },
      "2.0.2": {
        "en": "BREAKING: Configuration is only working in the new Admin 5 UI!\nDid bigger adjustments to the recording logic and added a lot of new Features. Please refer to Changelog and Forum post for details.",
        "de": "BREAKING: Die Konfiguration funktioniert nur in der neuen Admin 5-Benutzeroberfläche!\nGrößere Anpassungen an der Aufnahmelogik vorgenommen und viele neue Features hinzugefügt. Einzelheiten finden Sie im Änderungsprotokoll und im Forumsbeitrag.",
        "ru": "НАРУШЕНИЕ: Конфигурация работает только в новом пользовательском интерфейсе Admin 5!\nВнесены большие коррективы в логику записи и добавлено много новых функций. Пожалуйста, обратитесь к журналу изменений и сообщению на форуме для получения подробной информации.",
        "pt": "URGENTE: a configuração está funcionando apenas na nova interface do usuário do Admin 5!\nFez ajustes maiores na lógica de gravação e adicionou muitos novos recursos. Consulte o Changelog e a postagem do fórum para obter detalhes.",
        "nl": "BREAKING: Configuratie werkt alleen in de nieuwe Admin 5 UI!\nGrotere aanpassingen gedaan aan de opnamelogica en veel nieuwe functies toegevoegd. Raadpleeg de Changelog en Forumpost voor details.",
        "fr": "RUPTURE : La configuration ne fonctionne que dans la nouvelle interface utilisateur d'Admin 5 !\nA apporté de plus grands ajustements à la logique d'enregistrement et ajouté de nombreuses nouvelles fonctionnalités. Veuillez vous référer au changelog et au post du forum pour plus de détails.",
        "it": "ROTTURA: la configurazione funziona solo nella nuova interfaccia utente di Admin 5!\nHa apportato maggiori modifiche alla logica di registrazione e aggiunto molte nuove funzionalità. Si prega di fare riferimento a Changelog e post sul forum per i dettagli.",
        "es": "ÚLTIMA HORA: ¡La configuración solo funciona en la nueva interfaz de usuario de Admin 5!\nHizo ajustes más grandes a la lógica de grabación y agregó muchas características nuevas. Consulte el registro de cambios y la publicación del foro para obtener más detalles.",
        "pl": "ŁAMANIE: Konfiguracja działa tylko w nowym interfejsie użytkownika Admin 5!\nWprowadziłem większe poprawki w logice nagrywania i dodałem wiele nowych funkcji. Więcej informacji można znaleźć w dzienniku zmian i poście na forum.",
        "zh-cn": "突破：配置仅在新的 Admin 5 UI 中有效！\n对录制逻辑进行了更大的调整，并添加了许多新功能。有关详细信息，请参阅变更日志和论坛帖子。"
      },
      "1.16.2": {
        "en": "Marked interpolated data with `i=true`",
        "de": "Markierte interpolierte Daten mit `i=true`",
        "ru": "Помеченные интерполированные данные с `i=true`",
        "pt": "Dados interpolados marcados com `i=true`",
        "nl": "Gemarkeerde geïnterpoleerde gegevens met `i=true`",
        "fr": "Données interpolées marquées avec `i=true`",
        "it": "Dati interpolati contrassegnati con `i=true`",
        "es": "Datos interpolados marcados con `i=true`",
        "pl": "Oznaczono dane interpolowane za pomocą `i=true`",
        "zh-cn": "用 `i=true` 标记插值数据"
      }
    },
    "mode": "daemon",
    "platform": "Javascript/Node.js",
    "loglevel": "info",
    "messagebox": true,
    "subscribe": "messagebox",
    "keywords": [
      "charts",
      "sql",
      "logging",
      "graphs",
      "archive"
    ],
    "preserveSettings": "custom",
    "supportCustoms": true,
    "getHistory": true,
    "enabled": true,
    "stopBeforeUpdate": true,
    "compact": true,
    "authors": [
      "bluefox <dogafox@gmail.com>",
      "Apollon77 <ingo@fischer-ka.de>"
    ],
    "license": "MIT",
    "readme": "https://github.com/ioBroker/ioBroker.sql/blob/master/README.md",
    "icon": "sql.png",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.sql/master/admin/sql.png",
    "type": "storage",
    "dependencies": [
      {
        "js-controller": ">=3.3.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "supportStopInstance": 10000,
    "stopTimeout": 10000,
    "plugins": {
      "sentry": {
        "dsn": "https://c30462d3e0834993b0aa29824346701e@sentry.iobroker.net/45"
      }
    },
    "adminUI": {
      "config": "json",
      "custom": "json"
    },
    "tier": 1,
    "eraseOnUpload": true,
    "connectionType": "none",
    "dataSource": "push",
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<2.0.0",
            "newVersion>=2.0.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "This new version introduces several changes how values are logged because we fixed several issues and added new features. Please especially check the defined \"debounce\" and \"block time\" settings in your datapoints if values are not logged as expected and make sure the settings make sense. For more details please refer to the changelog and Readme.",
          "de": "Diese neue Version führt mehrere Änderungen ein, wie Werte protokolliert werden, da wir mehrere Probleme behoben und neue Funktionen hinzugefügt haben. Bitte überprüfen Sie insbesondere die definierten „Entprellen“- und „Sperrzeit“-Einstellungen in Ihren Datenpunkten, wenn Werte nicht wie erwartet protokolliert werden, und stellen Sie sicher, dass die Einstellungen sinnvoll sind. Weitere Details finden Sie im Changelog und in der Readme.",
          "ru": "В этой новой версии внесено несколько изменений в регистрацию значений, поскольку мы исправили несколько проблем и добавили новые функции. Пожалуйста, особенно проверьте определенные настройки «debounce» и «block time» в ваших точках данных, если значения не регистрируются должным образом, и убедитесь, что настройки имеют смысл. Для получения более подробной информации, пожалуйста, обратитесь к журналу изменений и Readme.",
          "pt": "Esta nova versão apresenta várias alterações na forma como os valores são registrados, pois corrigimos vários problemas e adicionamos novos recursos. Verifique especialmente as configurações definidas de \"debounce\" e \"block time\" em seus pontos de dados se os valores não forem registrados conforme o esperado e verifique se as configurações fazem sentido. Para obter mais detalhes, consulte o log de alterações e o Leiame.",
          "nl": "Deze nieuwe versie introduceert verschillende wijzigingen in de manier waarop waarden worden geregistreerd, omdat we verschillende problemen hebben opgelost en nieuwe functies hebben toegevoegd. Controleer vooral de gedefinieerde \"debounce\" en \"block time\" instellingen in uw datapunten als de waarden niet zijn vastgelegd zoals verwacht en zorg ervoor dat de instellingen kloppen. Raadpleeg de changelog en Readme voor meer informatie.",
          "fr": "Cette nouvelle version introduit plusieurs changements dans la journalisation des valeurs car nous avons corrigé plusieurs problèmes et ajouté de nouvelles fonctionnalités. Veuillez vérifier en particulier les paramètres \"anti-rebond\" et \"temps de blocage\" définis dans vos points de données si les valeurs ne sont pas enregistrées comme prévu et assurez-vous que les paramètres ont un sens. Pour plus de détails, veuillez consulter le journal des modifications et le fichier Lisez-moi.",
          "it": "Questa nuova versione introduce diverse modifiche al modo in cui i valori vengono registrati perché abbiamo risolto diversi problemi e aggiunto nuove funzionalità. Controllare in particolare le impostazioni definite \"debounce\" e \"block time\" nei propri datapoint se i valori non sono registrati come previsto e assicurarsi che le impostazioni abbiano un senso. Per maggiori dettagli, fare riferimento al log delle modifiche e al Leggimi.",
          "es": "Esta nueva versión introduce varios cambios en la forma en que se registran los valores porque solucionamos varios problemas y agregamos nuevas funciones. Verifique especialmente la configuración definida de \"antirrebote\" y \"tiempo de bloqueo\" en sus puntos de datos si los valores no se registran como se esperaba y asegúrese de que la configuración tenga sentido. Para obtener más detalles, consulte el registro de cambios y el archivo Léame.",
          "pl": "Ta nowa wersja wprowadza kilka zmian w sposobie rejestrowania wartości, ponieważ naprawiliśmy kilka problemów i dodaliśmy nowe funkcje. W szczególności sprawdź zdefiniowane ustawienia „odbicia” i „czasu blokowania” w punktach danych, jeśli wartości nie są rejestrowane zgodnie z oczekiwaniami i upewnij się, że ustawienia mają sens. Aby uzyskać więcej informacji, zapoznaj się z dziennikiem zmian i Readme.",
          "zh-cn": "这个新版本引入了一些更改值的记录方式，因为我们修复了几个问题并添加了新功能。如果未按预期记录值，请特别检查数据点中定义的“去抖动”和“阻塞时间”设置，并确保设置有意义。有关更多详细信息，请参阅更改日志和自述文件。"
        },
        "link": "https://github.com/ioBroker/ioBroker.sql/blob/master/README.md#settings",
        "level": "warn",
        "linkText": {
          "en": "Readme",
          "de": "Liesmich",
          "ru": "Прочти меня",
          "pt": "Leia-me",
          "nl": "Leesmij",
          "fr": "Lisez-moi",
          "it": "Leggimi",
          "es": "Léame",
          "pl": "Readme",
          "zh-cn": "自述文件"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "connLink": "",
    "debounce": 1000,
    "retention": 31536000,
    "host": "localhost",
    "port": 0,
    "user": "",
    "password": "",
    "dbtype": "sqlite",
    "fileName": "sqlite.db",
    "requestInterval": 0,
    "encrypt": false,
    "round": 4,
    "dbname": "iobroker",
    "multiRequests": true,
    "maxConnections": 100,
    "changesRelogInterval": 0,
    "changesMinDelta": 0,
    "writeNulls": true,
    "doNotCreateDatabase": false,
    "maxLength": 0,
    "blockTime": 0,
    "debounceTime": 0,
    "disableSkippedValueLogging": false,
    "enableLogging": false,
    "rejectUnauthorized": false,
    "customRetentionDuration": 365
  },
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If connected to DB",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ],
  "objects": []
}
